package cn.com.yusong.yhdg.webserver.constant;

public class AppConstEnum {

    public enum Menu {
        MENU_00("00", "主页"),
        MENU_01("01", "平台"),
        MENU_02("02", "运营商"),
        MENU_03("03", "换电"),
        MENU_04("04", "消息"),
        MENU_05("05", "结算"),
        MENU_06("06", "统计"),
        MENU_07("07", "系统"),

        //平台01
        MENU_01_01("0101", "会员管理"),
        MENU_01_01_01("010101", "会员管理"),
        MENU_01_01_02("010102", "会员充值"),

        MENU_01_02_01("010201", "平台公告"),

        MENU_01_03("0103", "运营商管理"),
        MENU_01_03_01("010301", "运营商管理"),
        MENU_01_03_02("010302", "运营商账户"),
        MENU_01_03_03("010303", "运营商充值"),

        MENU_01_04_01("010401", "系统电池型号"),

        MENU_01_05("0105", "电池配置"),
        MENU_01_05_01("010501", "电芯型号管理"),
        MENU_01_05_02("010502", "电芯规格管理"),
        MENU_01_05_03("010503", "电芯检验"),
        MENU_01_05_04("010504", "电池规格管理"),
        MENU_01_05_05("010505", "电池检验"),

        MENU_01_06("0106", "上线管理"),
        MENU_01_06_01("010601", "换电柜上线审核"),
        MENU_01_06_02("010602", "电池分成模板"),
        MENU_01_06_03("010603", "换电柜分成模板"),

        MENU_01_07("0107", "用户指南协议"),
        MENU_01_07_01("010701", "用户指南"),
        MENU_01_07_02("010702", "协议管理(富文本)"),

        MENU_01_08("0108", "其他配置"),
        MENU_01_08_01("010801", "运营商配置管理"),
        MENU_01_08_02("010802", "移动救援"),
        MENU_01_08_03("010803", "意见反馈"),
        MENU_01_08_04("010804", "充值配置"),
        MENU_01_08_05("010805", "白名单配置"),

        MENU_01_09("0109", "商户平台管理"),
        MENU_01_09_05("010905", "平台账户管理"),
        MENU_01_09_01("010901", "商户管理"),
        MENU_01_09_02("010902", "公众号配置"),
        MENU_01_09_03("010903", "生活号配置"),
        MENU_01_09_04("010904", "APP配置"),

        MENU_01_10("0110", "提现管理"),
        MENU_01_10_01("011001", "提现申请"),

        //运营商 02
        MENU_02_01("0201", "运营商管理"),
        MENU_02_01_01("020101", "运营商管理"),
        MENU_02_01_02("020102", "运营商账户管理"),
        MENU_02_01_03("020103", "运营商角色管理"),
        MENU_02_01_04("020104", "运营商充值"),

        MENU_02_02_01("020201", "运营商公告"),

        MENU_02_03("0203", "位置纠错"),
        MENU_02_03_01("020301", "位置纠错"),
        MENU_02_03_02("020302", "纠错免人员"),

        MENU_02_04("0204", "优惠券管理"),
        MENU_02_04_01("020401", "优惠券配置"),
        MENU_02_04_02("020402", "优惠券订单"),

        MENU_02_05("0205", "拉新管理"),
        MENU_02_05_01("020501", "拉新人员"),
        MENU_02_05_02("020502", "拉新记录"),
        MENU_02_05_03("020503", "拉新订单"),
        MENU_02_05_04("020504", "拉新客户"),
        MENU_02_05_05("020505", "拉新规则"),

        MENU_02_06_01("020601", "客户白名单"),

        MENU_02_07_01("020701", "门店管理"),
        MENU_02_07_02("020702", "门店账户管理"),

        //换电 03
        MENU_03_01_01("030101", "电池型号管理"),
        MENU_03_02_01("030201", "电池管理"),
        MENU_03_03_01("030301", "换电柜管理"),
        MENU_03_04_01("030401", "终端屏幕管理"),
        MENU_03_05_01("030501", "活动管理"),
        MENU_03_06_01("030601", "白名单管理"),

        MENU_03_07("0307", "订单管理"),
        MENU_03_07_01("030701", "押金订单"),
        MENU_03_07_02("030702", "租金订单"),
        MENU_03_07_03("030703", "换电订单"),
        MENU_03_07_04("030704", "退租订单"),
        MENU_03_07_05("030705", "保险订单"),

        MENU_03_08_01("030801", "故障管理"),
        MENU_03_09_01("030901", "故障反馈"),

        MENU_03_10_01("031001", "退款管理"),

        //消息 04
        MENU_04_01("0401", "短信消息"),
        MENU_04_01_01("040101", "短信接口"),
        MENU_04_01_02("040102", "短信模板"),
        MENU_04_01_03("040103", "短信记录"),
        MENU_04_01_04("040104", "自定义短信"),

        MENU_04_02("0402", "app消息"),
        MENU_04_02_01("040201", "消息推送模板"),
        MENU_04_02_02("040202", "消息记录"),
        MENU_04_02_03("040203", "会员通知消息"),
        MENU_04_02_04("040204", "用户通知消息"),

        MENU_04_03("0403", "公众号消息"),
        MENU_04_03_01("040301", "公众号模板"),
        MENU_04_03_02("040302", "公众号消息记录"),
        MENU_04_03_03("040303", "自定义消息"),

        MENU_04_04("0404", "生活号消息"),
        MENU_04_04_01("040401", "生活号模板"),
        MENU_04_04_02("040402", "生活号消息记录"),

        //结算 05
        MENU_05_01("0501", "结算记录"),
        MENU_05_01_01("050101", "运营商日结算"),
        MENU_05_01_02("050102", "结算转账记录"),
        MENU_05_01_03("050103", "材料日统计"),

        MENU_05_02("0502", "支付凭证"),
        MENU_05_02_01("050201", "微信订单"),
        MENU_05_02_02("050202", "支付宝订单"),
        MENU_05_02_03("050203", "公众号订单"),
        MENU_05_02_04("050204", "生活号订单"),

        MENU_05_03_01("050301", "实名认证记录"),

        MENU_05_04("0504", "流水管理"),
        MENU_05_04_01("050401", "平台现金流水"),
        MENU_05_04_02("050402", "运营商收入支出流水"),

        //统计 06
        MENU_06_01("0601", "运营商统计"),
        MENU_06_01_01("060101", "运营商日统计"),
        MENU_06_01_02("060102", "运营商月统计"),
        MENU_06_01_03("060103", "门店日统计"),

        MENU_06_02("0602", "换电统计"),
        MENU_06_02_01("060201", "换电日统计"),
        MENU_06_02_02("060202", "换电月统计"),

        MENU_06_03("0603", "平台统计"),
        MENU_06_03_01("060301", "客户日活"),
        MENU_06_03_02("060302", "客单量统计"),
        MENU_06_03_03("060303", "平台日统计"),
        MENU_06_03_04("060304", "平台月统计"),


        //系统 07
        MENU_07_01("0701", "账户权限管理"),
        MENU_07_01_01("070101", "用户管理"),
        MENU_07_01_02("070102", "角色管理"),

        MENU_07_02("0702", "升级管理"),
        MENU_07_02_01("070201", "手机端升级"),
        MENU_07_02_02("070202", "屏幕升级"),
        MENU_07_02_03("070203", "电池升级"),
        MENU_07_02_04("070204", "换电柜升级"),

        MENU_07_03("0703", "系统配置"),
        MENU_07_03_01("070301", "系统配置"),
        MENU_07_03_02("070302", "字典管理"),;
        private final String value;
        private final String name;

        Menu(String value, String name) {
            this.value = value;
            this.name = name;
        }

        public String getValue() {
            return value;
        }

        public String getName() {
            return name;
        }
    }

    public enum AgentConfigKey {
        TERMINAL_TIMEOUT_TIME("terminal.timeout.time"),
        VIDEO_SUFFIX("video.suffix"),
        IMAGE_SUFFIX("image.suffix"),
        MIN_SPEED("min.speed"),
        DOWNLOAD_COUNT("download.count"),
        VIDEO_FORMAT_SWITCH("video.format.switch"),
        VIDEO_CONVERT_FORMAT("video.convert.format"),
        VIDEO_FORMAT_CMD("video.format.cmd");

        private final String value;

        AgentConfigKey(String value) {
            this.value = value;
        }

        public String getValue() {
            return value;
        }
    }

}
